       IDENTIFICATION DIVISION.
       PROGRAM-ID. EIGER06.
      * Listing 3.11.   - Page 67
      * This ilustrates a structured program.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

         01 THE-MESSAGE PIC X(50).
         01 THE-NUMBER PIC 9(2).
         01  A-SPACE PIC X.

       PROCEDURE DIVISION.
      * Level 1 routines
       PROGRAM-BEGIN.
           PERFORM PROGRAM-INITIALIZATION.
           PERFORM MAIN-LOGIC.
       PROGRAM-DONE.
           STOP RUN.
      * Level 2 routines
        PROGRAM-INITIALIZATION.
      * Initialize the sapce variable
            MOVE  " " TO A-SPACE.
      * Start THE-NUMBER AT 0
            MOVE  0  TO THE-NUMBER.

          MAIN-LOGIC.
      * Set up and display line 1
            MOVE  "There once was a lady from Eiger,"
                  TO THE-MESSAGE.
            PERFORM ADD-NUMBER-AND-DISPLAY.

      * Set up and display line 2
            MOVE  "who smiled and rode forth on a tiger."
                  TO THE-MESSAGE.
            PERFORM ADD-NUMBER-AND-DISPLAY.

      * Set up and display line 3
            MOVE  "They returned from the ride"    TO THE-MESSAGE.
            PERFORM ADD-NUMBER-AND-DISPLAY.

      * Set up and display line 4
            MOVE  "with the lady inside,"    TO THE-MESSAGE.
            PERFORM ADD-NUMBER-AND-DISPLAY.

      * Set up and display line 5
              MOVE  "And the smile o the face of the tiger."
              TO THE-MESSAGE.
            PERFORM ADD-NUMBER-AND-DISPLAY.
      * Level 3 routines
      * This paragraph is performed 5 times
      * MAIN LOGIC.

       ADD-NUMBER-AND-DISPLAY.
            ADD 1 TO THE-NUMBER.
            DISPLAY
            THE-NUMBER
            A-SPACE
            THE-MESSAGE.
