       UNDONE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. RANGE01.
      * Listing 4.11. Combining tests with AND. Page 87
      * Asks user for a number between 10 and 100
      * exclusive prints a messsage if the entry is in range.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

         01 MENU-NUMBER PIC 999.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           PERFORM GET-THE-NUMBER.
           PERFORM CHECK-THE-NUMBER.
       PROGRAM-DONE.
             STOP RUN.

      *Level 2 Routines
       GET-THE-NUMBER.
           PERFORM DISPLAY-THE-MENU.
           PERFORM GET-THE-NUMBER.

       CHECK-THE-NUMBER.
             IF MENU-NUMBER < 1 OR
             MENU-NUMBER > 3
             DISPLAY 'Invalid selection'.

             IF MENU-NUMBER = 1
             DISPLAY 'One for the money'.

             IF MENU-NUMBER = 2
             DISPLAY 'Two for the show'.

             IF MENU-NUMBER = 3
             DISPLAY 'Three to get ready'.

      *Level 3 routines
       DISPLAY-THE-MENU.
           DISPLAY 'Pls enter the n. of the msg,'
           DISPLAY 'that you wish to display.'
      *Diplay a blank line
           DISPLAY ' '.
           DISPLAY '1st MSG'.
           DISPLAY '2nd MSG'.
           DISPLAY '3rd MSG'.

      *Diplay a blank line
           DISPLAY ' '.
           DISPLAY 'Your selection (1-3)?'.
       GET-THE-NUMBER.
           ACCEPT MENU-NUMBER FROM SYSIN.
