       IDENTIFICATION DIVISION.
       PROGRAM-ID. WRDSRT01.
      * Listing 4.7  An incorrect version of the test Pg 84
      * Accepts 2 words from user and then displays
      * them in ASCII order.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

         01 WORD-1    PIC X(50).
         01 WORD-2    PIC X(50).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           PERFORM INITIALIZE-PROGRAM.
           PERFORM ENTER-THE-WORDS.
           PERFORM DISPLAY-THE-WORDS.
       PROGRAM-DONE.
             STOP RUN.

      *Level 2 Routines
       INITIALIZE-PROGRAM.
               MOVE ' ' TO WORD-1.
               MOVE ' ' TO WORD-2.
       ENTER-THE-WORDS.
             DISPLAY 'This PGM will accept 2 words,'.
             DISPLAY 'and then display them'.
             DISPLAY 'in ASCII order.'.

             DISPLAY 'Pls enter the 1st word'.
             ACCEPT WORD-1 FROM SYSIN.

             DISPLAY 'Pls enter the 2nd word'.
             ACCEPT WORD-2 FROM SYSIN.

       DISPLAY-THE-WORDS.
             DISPLAY 'The words in ASCII oder are:'.

           IF WORD-1 < WORD-2
              DISPLAY WORD-1
              DISPLAY WORD-2.

           IF WORD-1 > WORD-2
              DISPLAY WORD-2
              DISPLAY WORD-1.
